import { Route, Routes } from "react-router-dom";
import "./App.css";
import MainPage from "./MainPage";
import InfoPage from "./InfoPage";
import Fights from "./Fights";

const confederationInfo = [
  {
    title: "Початок",
    text: "Конфедерація, відома також як Конфедеративні Штати Америки (КША), була політичним і військовим союзом, що існував протягом громадянської війни в Сполучених Штатах Америки з 1861 по 1865 роки. Конфедерація була сформована з 11 південних штатів, які вийшли зі складу США після вибору Авраама Лінкольна на посаду президента.",
  },
  {
    title: "",
    text: "Причиною розколу між Північчю і Півднем були глибокі розбіжності щодо питання рабства, економічних і політичних прав південних штатів. Коли Лінкольн і його партія Республіканської платформи виступили проти подальшого поширення рабства на нові території, багато південних штатів вважали це порушенням їх прав і вирішили вийти зі складу США.",
  },
  {
    title: "",
    text: "У лютому 1861 року в Монтгомері, Алабама, була утворена Конфедерація. Джефферсон Девіс був обраний президентом Конфедерації, а Ричард Монтґомері встановився на посаді віце-президента. Конфедерація прийняла власний конституційний акт, в якому було закріплено право штатів на рабство та незалежність від федерального уряду.",
  },
  {
    title: "Активні бойові дії",
    text: "Затяжна громадянська війна між Конфедерацією та Союзом (північними штатами) розпочалася 12 квітня 1861 року, коли військові сили Конфедерації обстріляли форт Самтер в Чарльстоні, Південна Кароліна. Протягом наступних чотирьох років обидві сторони ведуть активні бойові дії, залучаючи значні ресурси та людські життя.",
  },
  {
    title: "",
    text: "Конфедерація мала кілька військових успіхів на початку війни, включаючи битви під Булл Ран та Фредеріксбургом. Проте з часом перевага перейшла на бік Союзу завдяки його численності, промисловій міці та кращому забезпеченню. Під командуванням генерала Улісеса Гранта та інших генералів Союзу, північні війська почали зазнавати успіхів і отримувати перемоги в важливих битвах, таких як битва під Геттісбергом та битва при Віксбурзі.",
  },
  {
    title: "",
    text: "Згода з більшими ресурсами та промисловим потенціалом Союзу веде до послаблення Конфедерації. У 1865 році генерал Союзу Вільям Шерман вчиняє відомий 'Марш морди' через південні штати, завдаючи значних матеріальних збитків Конфедерації. 9 квітня 1865 року генерал Роберт Лі з Конфедерації капітулює перед генералом Грантом, означаючи практично кінець війни.",
  },
  {
    title: "Закінчення",
    text: "Після капітуляції Конфедерації була розпущена, і південні штати повернулися до Союзу. Війна призвела до скасування рабства в США та посилила централізовану владу федерального уряду над штатами.",
  },
  {
    title: "",
    text: "Громадянська війна в США мала величезні наслідки для країни, суспільства та політики. Вона поклала початок новому етапу в історії США та сприяла закріпленню єдності та незалежності країни.",
  },
];

const federationInfo = [
  {
    title: "Початок",
    text: 'У громадянській війні в Сполучених Штатах Америки (1861-1865) Федерація виступала захисником єдності країни та збереження федеральної влади. Термін "Федерація" в цьому контексті відноситься до Союзу, що об\'єднував північні штати США та вірних їм південних штатів, які залишилися вірними Союзу.',
  },
  {
    title: "",
    text: "Протягом 1850-их та 1860-их років напруження між північними та південними штатами росло через розбіжності щодо рабства, торгових правил та правила прийому нових штатів. Незгода стосовно розширення рабства на західні території була однією з основних причин конфлікту. Федерація, представлена владою Союзу, прагнула зберегти й посилити свою централізовану владу та контроль над штатами.",
  },
  {
    title: "Новий презедент",
    text: "У 1860 році Авраам Лінкольн, кандидат Республіканської партії, став президентом Сполучених Штатів. Його перемога на виборах була сприйнята південними штатами як загроза їхнім інтересам та правам. Внаслідок цього, південні штати, починаючи з Південної Кароліни, почали виймати зі складу США та оголошувати про формування Конфедерації.",
  },
  {
    title: "",
    text: "Федерація реагувала на цей розкол шляхом проголошення війни Конфедерації з метою збереження територіальної єдності Сполучених Штатів. Лінкольн заявив, що головною метою війни є відновлення єдності країни та забезпечення збереження федеральної влади над штатами.",
  },
  {
    title: "Військовий ріст",
    text: "Протягом війни Федерація розвивала великі військові сили, залучаючи рекрутів з різних штатів та створюючи сильну армію та флот. Під командуванням генералів, таких як Улісес Грант, Вільям Шерман та Джордж Макклеллан, Федерація проводила військові операції на різних фронтах з метою підкорення Конфедерації.",
  },
  {
    title: "",
    text: "З часом Федерація змогла здобути перевагу над Конфедерацією завдяки своїм великим ресурсам, численності та промисловому потенціалу. Битви, такі як Геттісберг та Антітам, стали стратегічними перемогами Федерації, що підірвали здатність Конфедерації продовжувати війну.",
  },
  {
    title: "Результат",
    text: "У квітні 1865 року генерал Роберт Лі, головний військовий лідер Конфедерації, капітулював перед генералом Грантом, ознаменувавши практично кінець війни. Конфедерація розпалася, а південні штати повернулися до Союзу.",
  },
  {
    title: "",
    text: "Громадянська війна мала величезний вплив на Сполучені Штати. Вона закінчилася поразкою Конфедерації та підкреслила важливість централізованої федеральної влади та збереження єдності країни. Після війни Сполучені Штати пройшли через процес реконструкції, щоб відновити пошкоджені воєнними діями території та вирішити питання рабства і громадянських прав.",
  },
];

function App() {
  return (
    <div class="main-style">
      <Routes>
        <Route path="/" element={<MainPage />} />
        <Route
          path="/confederation"
          element={<InfoPage information={confederationInfo} element="confederation" />}
        />
        <Route path="/fights" element={<Fights />} />
        <Route path="/federation" element={<InfoPage information={federationInfo} element="federation" />} />
      </Routes>
    </div>
  );
}

export default App;
